/*
    Визначити порядок, за яким мають бути прочитані
    дисципліни під час навчання однієї з академічних груп. Моделювання
    виконати за допомогою графа, вершини якого представляють
    дисципліни, а орієнтовані ребра позначають вимоги до дисциплін
    (наприклад, курс C має бути прочитаний перед курсами A і B, а курс
    D – після курсу А тощо).
*/

#include <iostream>
#include "graph.hpp"
#include <vector>

int main(int argc, char** argv) {
    graph g{{
        {0,0,1,1},
        {0,0,1,0},
        {0,0,0,0},
        {0,0,0,0},
    }};
    std::cout << g << std::endl;
    return 0;
}