/*
    Розробити програмне забезпечення, в якому реалізується
    алгоритм обходу графу на основі пошуку в глибину. Передбачити, що
    граф може бути як орієнтований, так і неорієнтований. В процесі
    пошуку має бути сформовано ліс пошуку в глибину. Для реалізації
    має використовуватися стек. Програмне забезпечення має бути
    побудовано на основі відповідного класу, який повинен дозволяти
    визначати граф, виконувати пошук в глибину, виводити побудований
    ліс пошуку в глибину, виводити результат обходу тощо.
*/

#include <iostream>

int main(int argc, char** argv) {
    
    return 0;
}