/*
    Компанія здає автомобіль престижного класу в оренду. В
    один робочий день було отримано n заявок для оренди. У кожній
    заявці 1≤ ≤i n визначено проміжок часу (si, fi), протягом якого клієнт
    бажає використовувати автомобіль. При цьому кожній такій заявці та
    відповідному інтервалу часу відповідає сума коштів pi, яку отримає
    компанія за оренду. Визначити таке рішення з надання даного
    автомобіля в оренду за заявками, яке дозволить отримати
    максимальний прибуток.
*/

#include <iostream>

int main(int argc, char** argv) {
    
    return 0;
}