/*
    Для заданого рядка символів визначити послідовність дій з
    розбиття рядка на задані частини, що характеризується мінімальними
    вимогами до часу виконання дій. Частини, на які необхідно розбити
    рядок, задаються порядковими номерами символів, які є межами
    частин рядка.
    
    Тобто якщо рядок довжиною 10 символів необхідно
    розділити на частини після символів 3, 5, то в результаті має бути
    сформовано три нові рядка: з першого до третього символу, з
    четвертого до п’ятого та з шостого до десятого. Дані розбиття можна
    виконати в порядку зліва направо або справо наліво (у випадку
    більшої кількості частин таких варіацій стає ще більше). Розбиття
    зліва направо має наступну вартість: 10 (розбиває рядок на 3 та 7
    символів) + 7 (розбиває рядок на 2 та 5 символів).
    
    Таким чином, в результаті необхідно визначити послідовність розбиття рядка,
    що характеризується мінімальною загальною вартістю за часом, та
    вартість такого розбиття.
*/

#include <stddef.h>
#include <iostream>
#include <vector>
#include <string>

// std::vector<std::stirng>
float split(std::string str, std::vector<size_t> split_index) {
    float time = 0.0f
    std::vector<size_t> dp{  };

    for (auto it = str.begin(); it != str.end(); ++it) {
        
    }

    return time;
}

int main(int argc, char** argv) {
// Input data.
    const char* input_str = "helloworld";
    std::vector<size_t> split_index{ 3, 5 };
// End.
    std::cout << split(input_str, split_index) << std::endl;
    return 0;
}